-- phpMyAdmin SQL Dump
-- version 4.7.7
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Апр 01 2018 г., 05:21
-- Версия сервера: 10.1.30-MariaDB
-- Версия PHP: 7.2.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `fraud`
--

-- --------------------------------------------------------

--
-- Структура таблицы `mobilephone`
--
DROP TABLE IF EXISTS `mobilephone`;
CREATE TABLE `mobilephone` (
  `id_mobilephone` int(11) NOT NULL COMMENT 'код записи',
  `code` int(3) NOT NULL COMMENT 'код мобильного оператора',
  `start` varchar(7) NOT NULL COMMENT 'начало диапазона номеров',
  `end` varchar(7) NOT NULL COMMENT 'конец диапазона номеров'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Мобильые номера Иркутской области' COLLATE=utf8_unicode_ci;;

--
-- Дамп данных таблицы `mobilephone`
--

INSERT INTO `mobilephone` (`id_mobilephone`, `code`, `start`, `end`) VALUES
(1, 900, '8377000', '8499999'),
(2, 901, '0136100', '0136199'),
(3, 901, '6300000', '6344999'),
(4, 901, '6400000', '6419999'),
(5, 901, '6500000', '6749999'),
(6, 902, '1700000', '1799999'),
(7, 902, '5100000', '5169999'),
(8, 902, '5190000', '5199999'),
(9, 902, '5400000', '5499999'),
(10, 902, '5600000', '5619999'),
(11, 902, '5660000', '5699999'),
(12, 902, '5760000', '5799999'),
(13, 902, '6000000', '7699999'),
(14, 904, '1100000', '1599999'),
(15, 908, '6400000', '6699999'),
(16, 908, '7700000', '7799999'),
(17, 914, '0000000', '0149999'),
(18, 914, '8700000', '9599999'),
(19, 924, '2900000', '2949999'),
(20, 924, '5300000', '5499999'),
(21, 924, '6000000', '6399999'),
(22, 924, '7000000', '7199999'),
(23, 924, '8200000', '8399999'),
(24, 924, '9900000', '9999999'),
(25, 929, '4300000', '4399999'),
(26, 934, '1110000', '1114999'),
(27, 934, '4310000', '4319999'),
(28, 950, '0500000', '1499999'),
(29, 952, '6100000', '6399999'),
(30, 953, '9900000', '9903999'),
(31, 958, '0280000', '0299999'),
(32, 958, '3834000', '3835999'),
(33, 958, '4582000', '4582999'),
(34, 958, '5133000', '5137499'),
(35, 958, '5395315', '5396204'),
(36, 958, '5780000', '5789999'),
(37, 958, '8502450', '8511049'),
(38, 964, '1000000', '1299999'),
(39, 964, '2100000', '2309999'),
(40, 964, '2600000', '2899999'),
(41, 964, '3500000', '3599999'),
(42, 964, '5400000', '5499999'),
(43, 964, '6500000', '6599999'),
(44, 964, '7300000', '7599999'),
(45, 964, '8000000', '8249999'),
(46, 983, '2400000', '2499999'),
(47, 983, '4000000', '4199999'),
(48, 983, '4400000', '4499999'),
(49, 983, '4600000', '4699999'),
(50, 983, '6900000', '6999999'),
(51, 984, '2700000', '2799999'),
(52, 991, '1187000', '1193999'),
(53, 991, '3703500', '3718499'),
(54, 991, '4326500', '4356999'),
(55, 991, '8884000', '8884999'),
(56, 996, '4350000', '4379999'),
(57, 999, '2303000', '2312999'),
(58, 999, '2510000', '2514999'),
(59, 999, '2530000', '2546999'),
(60, 999, '4200000', '4209999'),
(61, 999, '4220000', '4236999'),
(62, 999, '6400000', '6449999'),
(63, 999, '6815000', '6869999');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `mobilephone`
--
ALTER TABLE `mobilephone`
  ADD PRIMARY KEY (`id_mobilephone`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `mobilephone`
--
ALTER TABLE `mobilephone`
  MODIFY `id_mobilephone` int(11) NOT NULL AUTO_INCREMENT COMMENT 'код записи', AUTO_INCREMENT=64;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
